FemDesign.Loads.ELoadGroupRelationship
Used for keeping track of the relationsship of the load cases in a group

FemDesign.Loads.ELoadGroupRelationship.Entire
If all cases are to be applied together

FemDesign.Loads.ELoadGroupRelationship.Alternative
If all cases are to be applied mutually exclusive

FemDesign.Loads.ELoadGroupRelationship.Simultaneous
If all cases are to be applied simultaneously

FemDesign.Loads.ELoadGroupRelationship.Custom
Custom combination pattern